app/controllers/products_controller.rb

  def create
    @product = Product.new(params[:product])

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("created_at", "name", "price", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Mon, 12 Mar 2012 09:59:22 UTC +00:00], ["name", "Demo"], ["price", #<BigDecimal:10d1634e8,'0.23E2',4(8)>], ["updated_at", Mon, 12 Mar 2012 09:59:22 UTC +00:00]]

  def update
    @product = Product.find(params[:id])

    respond_to do |format|
      if @product.update_attributes(params[:product])
---
SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT 1  [["id", "2"]]
UPDATE "products" SET "name" = 'Demowwm,nqew', "updated_at" = '2012-03-12 11:06:42.955895' WHERE "products"."id" = 2